src/Catalogs/ПравилаКонвертацииПредопределенныхДанных/ПравилаКонвертацииПредопределенныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d0aeb7f1-3c00-46ca-a311-452aa54a89c9">
  <name>ПравилаКонвертацииПредопределенныхДанных</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Catalog>

src/Catalogs/Объекты/Объекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ac03d05d-31ff-4be8-8134-befc15ed8a20">
  <name>Объекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f6c31941-e0ce-4411-9dc8-1dca828a5160">
    <name>Тип</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>кфкИмяEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="35277a40-8eae-4ba3-886e-04e15c93bfdc">
    <name>Имя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ПравилаКонвертацииПредопределенныхДанных/Forms/ФормаЭлементаXDTO/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура кфкЗаполнитьИдентификаторПосле(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Код = кфкПолучитьИдентификатор(Объект.ОбъектКонфигурации, Объект.ГруппаПравил);
	
	Если Не (Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения) Тогда
		Объект.Код = Объект.Код + ?(Объект.ИспользоватьДляПолучения, "_Получение", "_Отправка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция кфкПолучитьИдентификатор(ОбъектКонфигурации, Группа)
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Объекты.Имя КАК Имя,
	|	Объекты.Тип КАК Тип,
	|	ПРЕДСТАВЛЕНИЕ(Объекты.Родитель) КАК Группа
	|ИЗ
	|	Справочник.Объекты КАК Объекты
	|ГДЕ
	|	Объекты.Ссылка = &Объект";
	Запрос.УстановитьПараметр("Объект", ОбъектКонфигурации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Группа = Выборка.Группа;
		
		ЧастиИмени = СтрРазделить(Выборка.Имя, "_", Ложь);
		Результат = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Тип) + "_" + ЧастиИмени[ЧастиИмени.ВГраница()];
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
